export const ham =                                               
`Лесь Подерв'янський.
Гамлєт, або Феномен датського кацапізма.

Дійові особи
Гамлєт, датський кацап.
Маргарита, мати Гамлєта.
Привид, страшне чудо, старанно прикрите замизганим в багнюку і сукровицю простирадлом.
Клавдій, хтивий дядько принца.
Зігмунд Фрейд, відомий психіатр.

Дiя перша.

Берег моря. Чути розбещенi крики морських птахiв, ревiння моржа, а також iншi звуки, iздаваємиє різною морською сволотою. Входить Гамлєт, вдягнутий в зручну приємну товстовку і такі ж самі парусинові штани. Гамлєт красиво підперезаний вузеньким шкіряним пояском. Він босий, бородатий і пацаватий. В руках у нього дебелий дрючок.

Гамлєт.  Як остопиздило купатися мені. Чи може іскупатися? Купатись чи не купатись? Блядські ці питання зайобують. То може, не вагаясь, спустити враз штани та батерфляєм хуярити, аж поки за буями в очах не потемніє? Ну а згодом? Про наслідки можливі не подумать? Один лиш тільки раз і вже крадеться піздець з своєю усмішкою хижой. Простуда, чіряк на сраці, запльована підлога, лікарі, від шприца гематоми і могила... На ній брудна Офелія вонюча та купка маргаріток, а під нею лежить той фраєр, що любив купатись. Такіє варіанти єбав я в рот і в носа. (Гамлєт харка у море і його дрючком пиздячить.)

Входить Клавдій, хтивий дядько принца.

Клавдій.  Мон шер Гамлєт! Ходімо в кабінєт. Канхвету дам тобі я посмоктати. Канхвета очєнь класна, Тузік вкусний. (Клавдій гидотно плямка, ізображая вкусний нехуйовий Тузік.)

У ту же мить із моря вилазить Привид у брудному простирадлі.

Привид.  Не вір, мій сину, цьому підорасу. Канхвету ту тобі він в жопу встромить.
Клавдій. А-а-а-а!!! (Тікає.)
Привид.  От бач, злякався, йобаний сцикун. Він обісцяв мене на полюванні, коли я міцно спав. Підступною рукою він в ухо спрямував брудного хуя. І скосопиздила моє прекрасне тіло смертельная гангрена. Помсти хочу! Побачить цю падлюку на параші, за грою в півника з неголеним убивцей, або в канторі сраним інженером, або у юрті раком на підлозі татари шоб його єбали в сраку!
Гамлєт.  Не можна мстить. Повинні ми любити всіх підорасів, злодіїв, убивць. Бо кожний з них - народ, всі - богоносці.
Привид(іронічно).  То може ти і м'яса не їси?
Гамлєт.  Ні, не їсу я м'яса принципово. Я тільки випить іноді люблю, бо ми народ широкий і гостинний і випити ми можем дохуя, намного більше інших інородців, жидів та басурман.
Привид.  Хуйова мода. Пробзділось шось у Дацькому князівстві... Коли я був царем, єбав я в жопу всіх богоносців в купі з Львом Толстим. Но це, конєшно, в смислє пєрєносном. Бо підорасів, з дєтства не любивши, посилав їх на хімію єбошить на благо Батьківщини. О часи, о Данія нещасна!
Гамлєт.  Ви, батьку, там привидом вже зовсім заєбались. Шось пиздите таке, що не просцяти і за цілий тиждень. Я же вам сказав, що мститися не можу, бо всі люди - це браття на землі, окрім жидів, татар, масонів, негрів, білорусів, которих я ненавиджу. В цілому я ж гуманіст, не те шо ви, папаша. Вам тільки би горілки засадить та мамку бідну на печі єбати, аж дим із хати йде. А потім чаю посьорбати і кидати сокиру в паралізовану бабуню, в унітаза хуярить чобітьми і так же много другої хуйні за вами замічав я. Навіщо ж вам було родного брата, слабкішого за вас своїм здоров'ям, примушувать лизати вам мін'єта? От він і єбанувся, бідолашний, і це не дивно. Мати моя, бідна, ненавиділа вас, як я жидів. Мене ж, синка хорошого, любила і часто пестила. А я із нею грався у котика та білочку. Ви, батьку, пиздуйте в ваше море та хутчіше, бо я дрючком переєбу єбальник щє й дядька позову і ми з ним разом таких піздюлєй вам понакладаєм, шо Данія здригнеться.
Привид.  Сучій сину, хуйовий нєдоносок! Так на батька! Таку хуйню казать! Чом не втопив я тебе в малаф'ї як ти родився? Чом не засунув в жопу головою і задушив? О курвяча сімейка! Зажди ж у мене! (Привид топиться у морі.)
Гамлєт.  Папаша блядский, в доску заєбали. Піти би випить в барі шампаньйоли, бо в сурлі мов коти понасцикали і несвідомо хочеться лизати шершавим язиком гарачі зуби...(Гамлєт уходить, моржі ревуть, птахи кричать, море шумить.)

Дія друга.

На сцені збоку стоїть рояль "Стенвей". На ньому лежать шпроти. Посеред сцени стоїть кацапське крісло, позбавлене художнього смаку. Над ними герб висить національний. На гербі зображено ведмедя. В одній руці у ведмідя молоток, а в другій - балалайка. Це символізує працелюбність і незакомплексованість тварюки. На кріслі сидить Маргаріта, мати Гамлєта, і вишива комірець в косовороточці. Вона наспівує "Камаріки". Непомітно, м'ягкою ходою підораса, входить Клавдій, хтивий дядько принца.

Клавдій.  Сьогодні я гуляв на датськом взмор'є з твоїм синком красівим. Я канхвету хорошу очєнь, вкусную, єму давав, но он нє взял, муділа.
Маргарита.  Какой чудак, єй богу...
Клавдій (сам до себе).  Я виєбу його. (До Маргарити.) Канхвєта Тузік, очєнь нє хуйова.
Маргарита (лагідно).  Бешкетнику...
Клавдій.  Чимсь бздить у кабінеті, неначє хтось насрав нечистоплотно. Відкрийте хвортку, хами, щоб пробзділось.

Підскочивши, два хама в косоворотках і чоботях швиденько відкривають хвортку і в нею в ту же мить влітає Привид.

Привид.  Ага, падлюки! Всім скидать штани і стати раком! Щас піздець вам буде, слівайте воду, йобані масони, чи як вас там.

Клавдій, Маргарита і хами виконують накази Привида, який дико регочє і літає по кабінєту.

Клавдій.  Мій Привиде, ніякої хуйні не робим ми. Ко всєм жидомасонам іспитуєм злобу і ненавість і каждий день національні гімни на балалайці хором ісполняєм. Бояться нас жиди та басурмани, престіж крєпчаєт, мощно возрастаєт дєнь ото дня процент жиров у маслі. Довольні хами, ситі в них єбала. Гораздо мєньшє стало підорасів, єбошать всі вони як папа Карло на хімії в Черкасах. Лєсбіянки - усі на Соловках.

Входить Гамлєт. Він в сраку п'яний. В одній руці у нього дрючок, а в другій - шампанське.

Привид.  Дивись, мій сину, це - жидомасони. Ти запиздяч дрючком їх по печінці, потом мєнє доложиш. Шо не ясно?

Гамлєт.  Папаша, всьо буде в лучшем відє, не хвилюйтесь.

Гамлєт пиздить усіх дрючком: пиздячить герба з ведмедєм, потім заливає шампанськоє в рояль і шпроти запускає туди ж. І по роялю пиздить дрючком. Рояль гуде.

Привид.  Мій сину, то рояль, а не жиди, його не надо пиздить. За валюту його я купував.

Гамлєт.  Єбав я всє роялі, і валюту, і всіх жидів.

Гамлєт пиздить Привида дрючком. Привид пада. На полу лежать трупи, попижжені Гамлєтом. В роялі тихо плавають шпроти. Входить Зігмунд Фрейд. Його окуляри таємничо блищать в темноті.

Гамлєт (потихеньку починає тверезитись).  Ітоги подвєдьом. Упиздив тата. І мамку запиздячив з рідним дядьком. Попиздив мєбєль ценную, герба національного хуйнув. Усюди смерть, розруха. Не буду більше пити я, хоч, правда, яка розумная цьому альтернатіва? Ех, блядська Данія! Піздєц всім сподіванням...

Гамлєт рве на собі толстовку. Тихо грає музика, приємний голос співа "Яблучко". Зігмунд Фрейд підходить до Гамлєта, коле його шприцем у сраку і уводить до божевільного дому. Hа сцені з'являються семеро матросів в жахливих чорних бушлатах. Пісня "Яблучко" переможно шириться. Під веселі звуки "Яблучка" матроси мовчки страшно відбивають чочотку.

Завіса.`