
// TODO: Add sequencing word generation like ('наї' / 'заї') + ('ба') + ('в' || 'ла' || 'ло' || 'ли' || 'ло')

export const wordMat = `
не
ні
на
рило
мило

я
ти
ми
вони
він
вона
воно
вони

їбу
їбеш
їбе
їбав
їбала
їбало
їбали
їбатиме
їбатимуть

хуй
хуйло
підхуйок
пизда
сраку

срака
дупа

березень
вересень

лизала

стояв
стояли
стояла
стояло
стоїть
стоятиме

лежало
лежала
лежав
лежить
лежатиме

заїбав
заїбали
заїбала
заїбало

все
нічого
дещо
ніщо
ніхто

ніяк
всяк
отак
перетак
йобтвоюмать

бувало
їбало

наїбала
наїбав
наїбало
наїбали
наїбуть
`;