export const wordNumbers = 
`один
два
три
чотири
п'ять
шість
сім
вісім
дев'ять
десять
одинадцять`;

export const syllablesDict = [
  { 'ля': 2 },
  { 'чим': 2 },
  { 'хо': 3 },
  { 'дя': 3 },
  { 'мі': 1 },
  { 'ї': 2 },
  { 'хав': 3 },
  { 'ду': 2 },
  { 'чи': 4 },
  { 'я': 2 },
  { 'тель': 4 },
  { 'шов': 5 },
  { 'ку': 1 },
  { ' ': 9 },
  { 'су': 1 },
  { 'вич': 3 },
  { 'ми': 1 },
  { 'кос': 1 },
  { 'об': 1 },
  { 'дить': 2 },
  { 'учи': 1 },
  { 'му': 1 },
  { 'би': 1 },
  { 'це': 1 },
  { 'цел': 2 },
  { 'том': 1 },
  { 'ко': 1 },
  { 'вал': 1 },
  { 'нєс': 1 },
  { 'дет': 1 },
  { 'но': 1 },
  { 'вез': 1 },
  { 'мет': 1 },
  { 'вет': 1 },
  { 'ви': 1 }
];

export const wordsWithGG = 
`--SECTION-->A
автобіоґрафия
автоґраф
аґа
аґи
аґент
аґрус
аґрес
аґрис
аґрист
аґрусовий
аґрусівка
аґрусівочка
аґу
аґусі
арґат
арґонія
--SECTION-->Б
баґа
баґари
байдиґи
балаґувати
балеґа
бардиґа
беґа
беґар
беґарник
беґас
беґеря
беґечати
беґоніти
безґрунтий
безґрунтовний
безґрунтовно
белеґа
биґарь
биґасень
биґи збивати
біґарь
біґос
буґа
булеґа
бульбеґа
--SECTION-->В
ваґаш
варґа
варґуля
веґеря
виґвинтити
виґуляри
--SECTION-->Г
гаджуґа
гевґати
герґев
--SECTION-->Ґ
ґабелковий
ґабелок
ґабзувати
ґаблі
ґава
ґавеґа
ґавеня
ґавзун
ґавити
ґавра
ґаврати
ґав'ячий
ґаґати
ґаґотати
ґаджала
ґаджалаґати
ґаджале
ґадзуля
ґазда
ґаздинечка
ґаздинити
ґаздинька
ґаздиня
ґаздівка
ґаздівний
ґаздівство
ґаздівський
ґаздовитий
ґаздонька
ґаздування
ґаздувати
ґаздусьо
ґайда
ґайдиця
ґайдичка
ґайдарь
ґайдиця
ґайдувати
ґала
ґалаґан
ґаламаґати
ґаланки
ґаланці
ґалда
ґалера
ґалиця
ґалунок
ґальон
ґальонка
ґалюґа
ґаляра
ґамнути
ґандж
ґанджа
ґанджовитий
ґанджули
ґандзолля
ґанзур
ґанок
ґаня
ґара
ґарґала
ґарґало
ґарґара
ґарґачки
ґард
ґардувати
ґарита
ґарлика
ґарнаґа
ґарований
ґарувати
ґахуватися
ґацик
ґвалт
ґвалтівний
ґвалтовний
ґвалтівно
ґвалтовне
ґвалтовно
ґвалтувати
ґвер
ґвинт
ґвинтик
ґвир
ґе-ґе-ґе
ґевґати
ґеґавка
ґеґадзи
ґеґання
ґеґати
ґеґекати
ґедз
ґедзатися
ґедзел
ґедзень
ґедзик
ґедзилля
ґедзкатися
ґедзле
ґедзунок
ґедкати
ґедло
ґезунд
ґел
ґелґати
ґелевач
ґелево
ґелета
ґелетя
ґелка
ґелкотати
ґельгів
ґелюх
ґемзати
ґензура
ґер
ґерґавка
ґерґелиця
ґерґелі
ґерґера
ґерґетати
ґерґетня
ґерґецки
ґерґечник
ґерґотання
ґерґотати
ґердан
ґереґа
ґерлак
ґерлянка
ґерувати
ґецатися
ґзимс
ґзитися
ґзівка
ґзунс
ґивт
ґивтати
ґивтнути
ґиґнути
ґила
ґилун
ґилькотіти
ґирґачка
ґирд
ґирланка
ґирлиґа
ґирувати
ґіб
ґівґач
ґіпс
ґірґи
ґірґожник
ґіцкатися
ґлеґ
ґлеґати
ґледжати
ґлей
ґлейт
ґловень
ґлузи
ґльоґ
ґльоґати
ґлюч
ґля
ґляґ
ґляґанець
ґляґаний
ґляґати
ґляґушки
ґнип
ґніт
ґноття
ґовда
ґоґа
ґоґози
ґоґозник
ґодло
ґолдувати
ґолка
ґондзоль
ґондзоляк
ґондзоляка
ґондзолячка
ґонет
ґонт
ґонталь
ґонтар
ґонтина
ґонтовий
ґонтя
ґонтаниця
ґорґоля
ґорґолястий
ґорсет
ґоспода
ґосподарити
ґосподарів
ґосподарка
ґосподарський
ґосподар
ґосподинин
ґосподиня
ґотка
ґотур
ґохнути
ґрайцар
ґрамузляти
ґранат
ґранатовий
ґраса
ґрасувати
ґрата
ґратчатий
ґратя
ґрацювати
ґреґорний
ґрейцар
ґреци
ґрече
ґречний
ґречність
ґречно
ґринджоли
ґринджолята
ґрис
ґрівджати
ґрона
ґрос
ґрузло
ґрулина
ґрулисько
ґрульовина
ґруля
ґруляник
ґрулянка
ґрундаль
ґрундзьований
ґрундзювати
ґрундзюватий
ґрунт
ґрунталя
ґрунтик
ґрунтівка
ґрунтовий
ґрунтовище
ґрунтовний
ґрунтувати
ґрунь
ґрявчати
ґуґля
ґуґлюватий
ґуґолька
ґуджулай
ґуджулька
ґудз
ґудзик
ґудзола
ґудзь
ґудзусь
ґуз
ґузва
ґузелець
ґузий
ґузулька
ґузуля
ґулати
ґулий
ґулька
ґуля
ґулька
ґунадза
ґуральня
ґурґула
ґурґуля
ґуцьок
ґуш
ґушуватий
--SECTION-->Д
джерґа
джерґати
джерґіт
джерґотати
джерґотня
джереґеля
джиґ
джиґавка
джиґели
джиґиря
джиґра
джиґун
джиґуха
джоґан
джолґнути
джуґан
джуґля
дзиґ
дзиґа
дзиґар
дзиґарі
дзиґармайстер
дзиґарний
дзиґарок
дзиґати
дзиґлик
дзиґликовий
дзиґличок
дзиґльований
дзиґлятко
дзиґнути
доґа
доґедзґатися
доґлебати
дриґ
дриґавка
дриґання
дриґати
дриґатися
дриґез
дриґнути
дригонути
дриґулька
друґар
--SECTION-->Ж
жоломиґа
--SECTION-->З
заґавити
заґавитися
заґвалтувати
заґеґотати
заґедзелити
заґедзкатися
заґелґати
заґервати
заґерґотати
заґрундзьовувати
заґудзлити
зґарда
зґвалтувати
зґедзатися
зґіґнути
зґляґатися
зґоя
зґрунтувати
--SECTION-->Й
йолупеґа
--SECTION-->Л
лаґун
леґа
леґавий
леґар
леґедуватися
леґейда
леґінь
леґувати
леґурний
леґурно
ліґерка
--SECTION-->М
маґура
маґель
маґельниця
маґільниця
маґеран
маґерка
маґіль
маґоль
маґлівниця
маґельниця
маґлювати
маґнес
маґнесувати
маґро
мазґливий
мамалиґа
миґа
миґдалевий
миґдаль
миґза
миґла
миґлаш
миґлювати
моґуля
морґ
морґовий
морґувати
морґуля
морґулька
--SECTION-->Н
наґвалтувати
наґрамузляти
наґунадзити
неґречний
неґречно
неґура
--SECTION-->О
орґанець
--SECTION-->П
перерумеґувати
поґаздувати
поґвалтувати
поґедзитися
поґерґотати
поґрасувати
поґулати
подриґати
подриґувати
подриґус
придзиґльований
придзиґльованка
проґавити
проґавитися
пуґачі
--SECTION-->Р
раґляк
раґаш
раґеля
ремеґати
риґівниця
риґувати
роґлик
розґедзґатися
розремеґатися
--SECTION-->С
саґан
саґаник
саґанчик
саґанець
сновиґайло
сновиґати
--SECTION-->У
уґабнути
уґвинтити
уґоґати
уґрундзьовувати
уґрунтувати
--SECTION-->Ф
фаґівник
фиґель
фиґлювати
фіґель
фурдиґати
--SECTION-->Х
хвиґа
хвиґлювати
хвиґура
хвиґурно
хуґа
хурдиґа
--SECTION-->Ц
цуґа
--SECTION-->Ш
шварґотання
шварґотати
швиґар
шеґеря
шмиґа
шпарґи
шпарґал
шпарґалля
--SECTION-->Я
яґрост
Власні назви
Ґабро
Ґенця
Ґец
Ґмитрик
Ґмитро
Ґой
Євґрап
Маґда`;

export const dumyMoiDumy =
`Ду-ми мо-ї, ду-ми мо-ї,
Ли-хо ме-ні з ва-ми!
На-що ста-ли на па-пе-рі
Сум-ни-ми ря-да-ми?..
Чом вас ві-тер не роз-ві-яв
В сте-пу, як пи-ли-ну?
Чом вас ли-хо не прис-па-ло,
Як сво-ю ди-ти-ну?..

Бо вас ли-хо на світ на сміх по-ро-ди-ло,
По-ли-ва-ли сльо-зи. чом не за-то-пи-ли,
Не ви-не-сли в мо-ре, не роз-ми-ли в по-лі?.
Не пи-та-ли б люде, що в ме-не бо-лить,
Не пи-та-ли б, за що про-кли-наю до-лю,
Чо-го нуд-жу сві-том? «Ні-чо-го ро-би-ть»,—
Не ска-за-ли б на сміх...

Кві-ти мо-ї, ді-ти!
На-що ж вас ко-хав я, на-що дог-ля-дав?
Чи за-пла-че сер-це од-но на всім сві-ті
Як я з ва-ми пла-кав Може, і вга-дав
Може най-деть-ся ді-во-че
Сер-це ка-рі очі
Що зап-ла-чуть на сі ду-ми
Я біль-ше не хо-чу
Од-ну сльо-зу з о-чей ка-рих
І пан над па-на-ми
Ду-ми мо-ї ду-ми мої
Ли-хо ме-ні з ва-ми!`;

export const wordsOfPyro = 
  `
  я шёл и думал о сирени
  вокруг визжали тормоза
  я выживал и приближался
  к местам где водится сирень

  хотела б я писать про вишни
  описывать как каждый день
  я выношу ведро с костями
  от вишен съеденных вчера

  сирень работает как чудо
  когда не смотрим на неё
  она как раз и производит
  нам лишний пятый лепесток

  сейчас я медленно открою
  ты так же медленно войдёшь
  ботинки снимешь осторожно
  в них вложишь снятые носки

  поели как обычно молча
  она стояла у окна
  вдруг обернулась и сказала
  оксимирон поёт как бог

  у нас немного потеплело
  и есть свободные слова
  которые тебя согреют
  пришлю их заказным письмом

  я был в краях где слов так мало
  что ими греются в мороз
  и лечат ими от болезней
  поэтому я не писал

  домохозяйка плачет в ванне
  чем экономит полчаса
  а то б пришлось сначала плакать
  а после ванну принимать

  меня кормили красным мясом
  поили огненной водой
  я выросла красивой сукой
  но с волосами на руках

  сегодня в ночь весна выходит
  она сидела взаперти
  её консервами кормили
  личинок майского жука

  кто верит мне что я богиня
  тот приезжает в три утра
  куда то в пермский частный сектор
  чтоб дать мне денег на такси

  с обратной стороны витрины
  вид на бульвар и мокрый снег
  и отвести глаза не может
  полураздетый манекен

  табло валют в окне мигает
  нам есть о чём поговорить
  ты привела с собой собачку
  а я в наушниках пришол

  вчера в саду поймали вора
  он нюхал редкие цветы
  и втягивал ноздрями запах
  и уносил его с собой

  четвёртый муж ушол в монахи
  он как и прежние мужья
  не сразу понял что лариса
  им не для счастия дана

  за сутки перед хэллоином
  я тьму старалась приручить
  бросая леденцы и чипсы
  в особо тёмные углы

  я прямо в душу вам смотрела
  и видела что вы не тот
  кем вы казались и мне нужно
  сию минуту вас убить

  и тут на мне повисли трое
  когда я совершил рывок
  с письмом в зубах на имя бога
  в котором объяснялось всё

  я из лона сказал геннадий
  а я из чрева молвил пётр
  а зинаида промолчала
  поскольку грубая была

  товарищ деньги я скучаю
  по нашим дням былых безумств
  мне вас ужасно не хватает
  о как мне не хватает вас`;
